* Katex API

A KaTeX string format converting server.

https://katex.org/

** Usage

Start the API server.
#+BEGIN_SRC sh
  docker run --rm -p 3000:3000 chanmo/katex
#+END_SRC


** API

*** Tex2Html

Convert the KaTeX string to HTML string.

Use httpie.
#+BEGIN_SRC bash
  http POST :3000/tex2html tex="x^2" --ignore-stdin 
#+END_SRC

#+RESULTS:
: <span class="katex-display fleqn"><span class="katex"><span class="katex-mathml"><math xmlns="http://www.w3.org/1998/Math/MathML" display="block"><semantics><mrow><msup><mi>x</mi><mn>2</mn></msup></mrow><annotation encoding="application/x-tex">x^2</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="base"><span class="strut" style="height:0.8641em;"></span><span class="mord"><span class="mord mathnormal">x</span><span class="msupsub"><span class="vlist-t"><span class="vlist-r"><span class="vlist" style="height:0.8641em;"><span style="top:-3.113em;margin-right:0.05em;"><span class="pstrut" style="height:2.7em;"></span><span class="sizing reset-size6 size3 mtight"><span class="mord mtight">2</span></span></span></span></span></span></span></span></span></span></span></span>

*** Tex2Mathml

Convert the KaTeX string to MathML string.

Use httpie.
#+BEGIN_SRC bash
  http POST :3000/tex2mathml tex="x^2" --ignore-stdin
#+END_SRC

#+RESULTS:
: <math xmlns="http://www.w3.org/1998/Math/MathML" display="block"><semantics><mrow><msup><mi>x</mi><mn>2</mn></msup></mrow><annotation encoding="application/x-tex">x^2</annotation></semantics></math>
